Repository: zkayia/nekodroid
Catalog: lib/localization/*.arb
Languages: fr

# localeDisplayName
source: English
fr: Français

# appTitle
source: Nekodoid
fr: Nekodroid

source: Home
fr: Accueil

# homeLatestEps
source: Latest episodes
fr: Derniers épisodes

# homeSeasonalAnimes
source: Seasonal animes
fr: Animes saisonniers

# homePopularAnimes
source: Popular animes
fr: Animes populaires

source: Library
fr: Bibliothèque

# libraryHistory
source: History
fr: Historique

# libraryHistoryDesc
source: Display the history tab in library, data isn't deleted
fr: Afficher l'onglet Historique dans la librarie, ne supprime pas les données

# libraryEmptyHistory
source: The history is empty
fr: L'historique est vide

# libraryFavorites
source: Favorites
fr: Favoris

# libraryFavoritesDesc
source: Display the favorites tab in library, data isn't deleted
fr: Afficher l'onglet Favoris dans la librarie, ne supprime pas les données

# libraryEmptyFavorites
source: No favorites
fr: Aucun favori

source: Search
fr: Recherche

# searchNoResults
source: No results
fr: Aucun résultat

# searchRecents
source: Searched recently
fr: Recherché récemment

# searchNoRecent
source: No recent searches
fr: Aucune recherche récente

# searchRecentsClearConfirm
source: Clear recent searches ?
fr: Vider les recherches récentes ?

# searchRecentsClearConfirmDesc
source: All recent searches will be deleted.
fr: Toutes les recherches récentes seront supprimées.

# searchdbStatus
source: {status, select, ready{Search} processing{Processing search data} fetching{Fetching search data} verifying{Verifying search data} other{Search unavailable - Tap to retry}}
fr: {status, select, ready{Recherche} processing{Traitement des données de recherche} fetching{Récupération des données de recherche} verifying{Vérification des données de recherche} other{Recherche indisponible - Appuyez pour réessayer}}

# searchFiltersResetConfirm
source: Reset filters ?
fr: Réinitialiser les filtres ?

# searchFiltersResetConfirmDesc
source: All current selected filters will be unselected.
fr: Tous les filtres actuellement sélectionnés seront désélectionnés.

# searchFiltersPersistModes
source: {mode, select, device{Always} session{Until app restart} route{While search is open}}
fr: {mode, select, device{Tout le temps} session{Jusqu'au redémarrage de l'application} route{Tant que la page de recherche est ouverte}}

source: More
fr: Plus

# morePrivateBrowsing
source: Private browsing
fr: Navigation privée

# morePrivateBrowsingDescription
source: Pauses navigation history
fr: Met en pause l'historique de navigation

source: Statistics
fr: Statistiques

source: Backup & restore
fr: Sauvegarder & restaurer

source: Settings
fr: Paramètres

# settingsGeneral
source: General
fr: Général

# settingsTheme
source: Theme
fr: Thème

# settingsThemes
source: {theme, select, system{Device} dark{Dark} light{Light}}
fr: {theme, select, system{Appareil} dark{Sombre} light{Clair}}

# settingsUseAmoled
source: Use AMOLED
fr: Utiliser l'AMOLED

# settingsUseAmoledDesc
source: Use a pure black background for the dark theme
fr: Utiliser un fond noir profond pour le thème sombre

# settingsLocale
source: Language
fr: Langage

# settingsDeviceLocale
source: Device language
fr: Language de l'appareil

# settingsNavLabel
source: Navigation labels
fr: Etiquettes de navigation

# settingsNavLabels
source: {navLabel, select, all{Always active} onlySelected{Only on selected} disabled{Never active}}
fr: {navLabel, select, all{Toujours activées} onlySelected{Seulement sur l'element selectionné} disabled{Jamais activées}}

# settingsDefaultPage
source: Default page
fr: Page par défaut

# enableNavbarSwipe
source: Quick navigation
fr: Navigation rapide

# enableNavbarSwipeDesc
source: Change page by swiping on the navigation bar
fr: Changer de page en glissant sur la barre de navigation

# reverseNavbarSwipe
source: Invert quick navigation
fr: Inverser la navigation rapide

# reverseNavbarSwipeDesc
source: Invert the quick navigation swipe direction
fr: Inverse le glissement de la navigation rapide

source: Carousel column count
fr: Nombre de colones du carousel

# episodeCardPressAction
source: Episode card tap action
fr: Action d'appui sur un épisode

# episodeCardLongPressAction
source: Episode card hold action
fr: Action d'appui long sur un épisode

# episodeCardActions
source: {action, select, playEpisodeNative{Play (native)} playEpisodeWebview{Play (webview)} openAnime{Open anime} copyAnimeTitle{Copy anime title} copyAnimeTitleWithEp{Copy anime title with episode number} copyEpisodeLink{Copy episode link} copyVideoLink{Copy video link} copyAnimeLink{Copy anime link} nothing{Do nothing}}
fr: {action, select, playEpisodeNative{Jouer (natif)} playEpisodeWebview{Jouer (webview)} openAnime{Ouvrir l'anime} copyAnimeTitle{Copier le title de l'anime} copyAnimeTitleWithEp{Copier le title de l'anime avec le numéro d'épisode} copyEpisodeLink{Copier le lien de l'épisode} copyVideoLink{Copier le lien de la vidéo} copyAnimeLink{Copier le lien de l'anime} nothing{Ne rien faire}}

# animeCardPressAction
source: Anime card tap action
fr: Action d'appui sur un anime

# animeCardLongPressAction
source: Anime card hold action
fr: Action d'appui long sur un anime

# animeCardActions
source: {action, select, openAnime{Open anime} playFirstEpNative{Play first episode (native)} playFirstEpWebview{Play first episode (webview)} copyTitle{Copy title} copyLink{Copy link} nothing{Do nothing}}
fr: {action, select, openAnime{Ouvrir l'anime} playFirstEpNative{Jouer le premier épisode (natif)} playFirstEpWebview{Jouer le premier épisode (webview)} copyTitle{Copier le titre} copyLink{Copier le lien} nothing{Ne rien faire}}

source: Default tab
fr: Onglet par défaut

# enableTabbarScrolling
source: Enable tabs bar scrolling
fr: Défilement de la barre des onglets

source: Auto open search bar
fr: Ouvrir automatiquement la barre de recherche

# autoOpenSearchBarDesc
source: Automatically open the search bar when navigating to the search tab
fr: Ouvre automatiquement la barre de recherche dans l'onglet recherche

# showAllWhenNoQuery
source: Show all when empty
fr: Afficher tout

# showAllWhenNoQueryDesc
source: Show all animes when the search bar is empty
fr: Afficher tout les animes lorsque la barre de recherche est vide

source: Exit on clear
fr: Sortir quand vide

# exitOnClearDesc
source: Exit when the clear button is used on an empty search bar
fr: Quitter quand le bouton efface est utilisé et que la barre de recherche est vide

# bottomExitButton
source: Exit button
fr: Bouton de sortie

# bottomExitButtonDesc
source: Enables the bottom exit button
fr: Activer le bouton de sortie en bas de l'écran

# bottomExitButtonFloat
source: Exit button float
fr: Faire flotter le bouton de sortie

# bottomExitButtonFloatDesc
source: Dynamically move the exit button above the keyboard
fr: Déplacer dynamiquement le bouton de sortie au dessus du clavier

# rememberSearchFilter
source: Remember search filters
fr: Se rappeler des filtres

# blurThumbs
source: Blur thumbnails
fr: Flouter les miniatures

# blurThumbsSigma
source: Blur intensity
fr: Force du flou

# blurThumbsShowSwitch
source: Show blur thumbnails switch
fr: Afficher le switch de flou

# confirmExit
source: Confirm before exiting
fr: Confirmer avant de sortir

# confirmExitDesc
source: Require two taps to exit using the back button
fr: Demander une confirmation avant de sortir avec le bouton retour

# confirmExitDuration
source: Confirm duration
fr: Temps de confirmation

# confirmExitDurationDesc
source: (seconds) The confirmation will disappear after
fr: (secondes) La confirmation disparaitra après

source: Remember last location
fr: Se rappeler de la dernière position

# rememberLastLocationDesc
source: Restart episodes at the last location
fr: Recommencer les episodes à la dernière position

source: Auto mark completed
fr: Marquer comme finis automatiquement

# autoMarkCompletedDesc
source: Mark episodes as completed when a threshold is reached
fr: Automatiquement marquer les episodes comme finis lorsqu'un seuil est franchi

source: Auto mark completed threshold
fr: Seuil de marquage automatique

# autoMarkCompletedThresholdDesc
source: (percentage %) Mark an episode as completed after
fr: (pourcent %) Marquer un episode comme finis après

source: Controls display duration
fr: Temps d'affichage des controles

# controlsDisplayDurationDesc
source: (seconds) The native player controls will be hidden after
fr: (secondes) Les controles du joueur natif disparaitrons après

source: Controls background transparency
fr: Transparence du fond des controles

# controlsBackgroundTransparencyDesc
source: (percentage %) Transparency of the shadow behind the controls
fr: (pourcent %) Transparence de l'ombre derrière les controles

source: Pause on controls display
fr: Pause quand les controles s'affichent

# pauseOnControlsDisplayDesc
source: Pause the video when the controls appear on screen
fr: Mettre la video en pause lorsque les controles s'affiche

source: Intro skip time
fr: Temps des introduction

# introSkipTimeDesc
source: (seconds) When the intro skip button is used, skip by
fr: (secondes) Quand le bouton pour passer les intros est utilisé, avancer de

source: Forward quick skip time
fr: Temps d'avance rapide

# forwardQuickSkipTimeDesc
source: (seconds) When the forward quick skip button is used, skip by
fr: (secondes) Quand le bouton d'avance rapide est utilisé, avancer de

source: Backward quick skip time
fr: Temps de retour rapide

# backwardQuickSkipTimeDesc
source: (seconds) When the backward quick skip button is used, go back by
fr: (secondes) Quand le bouton de retour rapide est utilisé, revenir de

source: Quick skip display duration
fr: Temps d'affichage du déplacement rapide

# quickSkipDisplayDurationDesc
source: (milliseconds) Hide the quick skip overlay after
fr: (millisecondes) Cacher le déplacement rapide après

# settingsAbout
source: About
fr: A propos

# animeNoSynopsis
source: No synopsis.
fr: Aucun synopsis.

# animeUnknownEpDuration
source: Unknown duration
fr: Durée inconnue

source: Player
fr: Lecteur

# playerConfirmExit
source: Press again to exit
fr: Appuyer encore pour sortir

# playerPlaybackSpeed
source: Playback speed
fr: Vitesse de lecture

# playerQuality
source: Quality
fr: Qualité

# playerEpStatus
source: {success, select, true{Episode {epNumber} marked as completed} false{Episode {epNumber} is already marked as completed}}
fr: {success, select, true{Episode {epNumber} marqué comme terminé} false{L'épisode {epNumber} est déjà marqué comme terminé}}

source: Popularity
fr: Popularité

# genres
source: {genre, select, action{action} adventure{adventure} battleRoyale{battle royale} comedy{comedy} cyberpunk{cyberpunk} drama{drama} ecchi{ecchi} fantasy{fantasy} hentai{hentai} horror{horror} isekai{isekai} mafia{mafia} magic{magic} magicalGirl{magical girl} mecha{mecha} military{military} music{music} mystery{mystery} psychological{psychological} romance{romance} sciFi{sci-fi} sliceOfLife{slice of life} sports{sports} supernatural{supernatural} thriller{thriller}}
fr: {genre, select, action{action} adventure{aventure} battleRoyale{battle royale} comedy{comédie} cyberpunk{cyberpunk} drama{drama} ecchi{ecchi} fantasy{fantastique} hentai{hentai} horror{horreur} isekai{isekai} mafia{mafia} magic{magique} magicalGirl{magical girl} mecha{mecha} military{militaire} music{musique} mystery{mystère} psychological{psychologique} romance{romance} sciFi{sci-fi} sliceOfLife{tranche de vie} sports{sports} supernatural{supernaturel} thriller{suspense}}

# types
source: {type, select, movie{Movie} ova{OVA} special{Special} tv{TV}}
fr: {type, select, movie{Film} ova{OVA} special{Spécial} tv{TV}}

# statuses
source: {status, select, aired{Aired} airing{Airing} planned{Planned}}
fr: {status, select, aired{Terminé} airing{En cours} planned{Pas commencé}}

# episodeCountShort
source: {count, plural, zero{? eps} one{1 ep} other{{count} eps}}
fr: {count, plural, zero{? ép} one{1 ép} other{{count} éps}}

# episodeCountLong
source: {count, plural, zero{? episodes} one{1 episode} other{{count} episodes}}
fr: {count, plural, zero{? épisode} one{1 épisode} other{{count} épisodes}}

# hoursLong
source: {count, plural, one{1 hour} other{{count} hours}}
fr: {count, plural, zero{0 heure} one{1 heure} other{{count} heures}}

# minutesShort
source: {count, plural, one{1 min} other{{count} mins}}
fr: {count, plural, zero{0 min} one{1 min} other{{count} mins}}

# minutesLong
source: {count, plural, one{1 minute} other{{count} minutes}}
fr: {count, plural, zero{0 minute} one{1 minute} other{{count} minutes}}

# secondsLong
source: {count, plural, one{1 second} other{{count} seconds}}
fr: {count, plural, zero{0 seconde} one{1 seconde} other{{count} secondes}}

# monthsShort
source: {month, select, 1{Jan} 2{Feb} 3{Mar} 4{Apr} 5{May} 6{Jun} 7{Jul} 8{Aug} 9{Sep} 10{Oct} 11{Nov} 12{Dec}}
fr: {month, select, 1{Jan} 2{Fév} 3{Mar} 4{Avr} 5{Mai} 6{Jun} 7{Jul} 8{Aoû} 9{Sep} 10{Oct} 11{Nov} 12{Déc}}

# monthsLong
source: {month, select, 1{January} 2{February} 3{March} 4{April} 5{May} 6{June} 7{July} 8{August} 9{September} 10{October} 11{November} 12{December}}
fr: {month, select, 1{Janvier} 2{Février} 3{Mars} 4{Avril} 5{Mai} 6{Juin} 7{Juillet} 8{Août} 9{Septembre} 10{Octobre} 11{Novembre} 12{Décembre}}
